grevaillot/svd_tools/headers/ATSAML11D15A/sercom0.h
#define SERCOM0_USART_CTRLB_LINCMD_SHIFT		24
#define SERCOM0_USART_CTRLB_LINCMD_MASK		0x03
/** @defgroup sercom0_usart_ctrlb_lincmd LINCMD LIN Command
@{*/
/**@}*/

/** SERCOM0_USART_CTRLB_RXEN Receiver Enable **/
#define SERCOM0_USART_CTRLB_RXEN		(1 << 17)
/** SERCOM0_USART_CTRLB_TXEN Transmitter Enable **/
#define SERCOM0_USART_CTRLB_TXEN		(1 << 16)
/** SERCOM0_USART_CTRLB_PMODE Parity Mode **/
#define SERCOM0_USART_CTRLB_PMODE		(1 << 13)
/** SERCOM0_USART_CTRLB_ENC Encoding Format **/
#define SERCOM0_USART_CTRLB_ENC		(1 << 10)
/** SERCOM0_USART_CTRLB_SFDE Start of Frame Detection Enable **/
#define SERCOM0_USART_CTRLB_SFDE		(1 << 9)
/** SERCOM0_USART_CTRLB_COLDEN Collision Detection Enable **/
#define SERCOM0_USART_CTRLB_COLDEN		(1 << 8)
/** SERCOM0_USART_CTRLB_SBMODE Stop Bit Mode **/
#define SERCOM0_USART_CTRLB_SBMODE		(1 << 6)

#define SERCOM0_USART_CTRLB_CHSIZE_SHIFT		0
#define SERCOM0_USART_CTRLB_CHSIZE_MASK		0x07
/** @defgroup sercom0_usart_ctrlb_chsize CHSIZE Character Size
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_ctrlc USARTCTRLC USART Control C
@{*/


#define SERCOM0_USART_CTRLC_MAXITER_SHIFT		20
#define SERCOM0_USART_CTRLC_MAXITER_MASK		0x07
/** @defgroup sercom0_usart_ctrlc_maxiter MAXITER Maximum Iterations
@{*/
/**@}*/

/** SERCOM0_USART_CTRLC_DSNACK Disable Successive NACK **/
#define SERCOM0_USART_CTRLC_DSNACK		(1 << 17)
/** SERCOM0_USART_CTRLC_INACK Inhibit Not Acknowledge **/
#define SERCOM0_USART_CTRLC_INACK		(1 << 16)

#define SERCOM0_USART_CTRLC_HDRDLY_SHIFT		10
#define SERCOM0_USART_CTRLC_HDRDLY_MASK		0x03
/** @defgroup sercom0_usart_ctrlc_hdrdly HDRDLY LIN Master Header Delay
@{*/
/**@}*/


#define SERCOM0_USART_CTRLC_BRKLEN_SHIFT		8
#define SERCOM0_USART_CTRLC_BRKLEN_MASK		0x03
/** @defgroup sercom0_usart_ctrlc_brklen BRKLEN LIN Master Break Length
@{*/
/**@}*/


#define SERCOM0_USART_CTRLC_GTIME_SHIFT		0
#define SERCOM0_USART_CTRLC_GTIME_MASK		0x07
/** @defgroup sercom0_usart_ctrlc_gtime GTIME Guard Time
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_i2cm_baud I2CMBAUD I2CM Baud Rate
@{*/


#define SERCOM0_I2CM_BAUD_HSBAUDLOW_SHIFT		24
#define SERCOM0_I2CM_BAUD_HSBAUDLOW_MASK		0xff
/** @defgroup sercom0_i2cm_baud_hsbaudlow HSBAUDLOW High Speed Baud Rate Value Low
@{*/
/**@}*/


#define SERCOM0_I2CM_BAUD_HSBAUD_SHIFT		16
#define SERCOM0_I2CM_BAUD_HSBAUD_MASK		0xff
/** @defgroup sercom0_i2cm_baud_hsbaud HSBAUD High Speed Baud Rate Value
@{*/
/**@}*/


#define SERCOM0_I2CM_BAUD_BAUDLOW_SHIFT		8
#define SERCOM0_I2CM_BAUD_BAUDLOW_MASK		0xff
/** @defgroup sercom0_i2cm_baud_baudlow BAUDLOW Baud Rate Value Low
@{*/
/**@}*/


#define SERCOM0_I2CM_BAUD_BAUD_SHIFT		0
#define SERCOM0_I2CM_BAUD_BAUD_MASK		0xff
/** @defgroup sercom0_i2cm_baud_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_spi_baud SPIBAUD SPI Baud Rate
@{*/


#define SERCOM0_SPI_BAUD_BAUD_SHIFT		0
#define SERCOM0_SPI_BAUD_BAUD_MASK		0xff
/** @defgroup sercom0_spi_baud_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_baud USARTBAUD USART Baud Rate
@{*/


#define SERCOM0_USART_BAUD_BAUD_SHIFT		0
#define SERCOM0_USART_BAUD_BAUD_MASK		0xffff
/** @defgroup sercom0_usart_baud_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_baud_frac_mode USARTBAUDFRACMODE USART Baud Rate
@{*/


#define SERCOM0_USART_BAUD_FRAC_MODE_FP_SHIFT		13
#define SERCOM0_USART_BAUD_FRAC_MODE_FP_MASK		0x07
/** @defgroup sercom0_usart_baud_frac_mode_fp FP Fractional Part
@{*/
/**@}*/


#define SERCOM0_USART_BAUD_FRAC_MODE_BAUD_SHIFT		0
#define SERCOM0_USART_BAUD_FRAC_MODE_BAUD_MASK		0x1fff
/** @defgroup sercom0_usart_baud_frac_mode_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_baud_fracfp_mode USARTBAUDFRACFPMODE USART Baud Rate
@{*/


#define SERCOM0_USART_BAUD_FRACFP_MODE_FP_SHIFT		13
#define SERCOM0_USART_BAUD_FRACFP_MODE_FP_MASK		0x07
/** @defgroup sercom0_usart_baud_fracfp_mode_fp FP Fractional Part
@{*/
/**@}*/


#define SERCOM0_USART_BAUD_FRACFP_MODE_BAUD_SHIFT		0
#define SERCOM0_USART_BAUD_FRACFP_MODE_BAUD_MASK		0x1fff
/** @defgroup sercom0_usart_baud_fracfp_mode_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_baud_usartfp_mode USARTBAUDUSARTFPMODE USART Baud Rate
@{*/


#define SERCOM0_USART_BAUD_USARTFP_MODE_BAUD_SHIFT		0
#define SERCOM0_USART_BAUD_USARTFP_MODE_BAUD_MASK		0xffff
/** @defgroup sercom0_usart_baud_usartfp_mode_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_rxpl USARTRXPL USART Receive Pulse Length
@{*/


#define SERCOM0_USART_RXPL_RXPL_SHIFT		0
#define SERCOM0_USART_RXPL_RXPL_MASK		0xff
/** @defgroup sercom0_usart_rxpl_rxpl RXPL Receive Pulse Length
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_i2cm_intenclr I2CMINTENCLR I2CM Interrupt Enable Clear
@{*/

/** SERCOM0_I2CM_INTENCLR_ERROR Combined Error Interrupt Disable **/
#define SERCOM0_I2CM_INTENCLR_ERROR		(1 << 7)
/** SERCOM0_I2CM_INTENCLR_SB Slave On Bus Interrupt Disable **/
#define SERCOM0_I2CM_INTENCLR_SB		(1 << 1)
/** SERCOM0_I2CM_INTENCLR_MB Master On Bus Interrupt Disable **/
#define SERCOM0_I2CM_INTENCLR_MB		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cs_intenclr I2CSINTENCLR I2CS Interrupt Enable Clear
@{*/

/** SERCOM0_I2CS_INTENCLR_ERROR Combined Error Interrupt Disable **/
#define SERCOM0_I2CS_INTENCLR_ERROR		(1 << 7)
/** SERCOM0_I2CS_INTENCLR_DRDY Data Interrupt Disable **/
#define SERCOM0_I2CS_INTENCLR_DRDY		(1 << 2)
/** SERCOM0_I2CS_INTENCLR_AMATCH Address Match Interrupt Disable **/
#define SERCOM0_I2CS_INTENCLR_AMATCH		(1 << 1)
/** SERCOM0_I2CS_INTENCLR_PREC Stop Received Interrupt Disable **/
#define SERCOM0_I2CS_INTENCLR_PREC		(1 << 0)

/**@}*/

/** @defgroup sercom0_spi_intenclr SPIINTENCLR SPI Interrupt Enable Clear
@{*/

/** SERCOM0_SPI_INTENCLR_ERROR Combined Error Interrupt Disable **/
#define SERCOM0_SPI_INTENCLR_ERROR		(1 << 7)
/** SERCOM0_SPI_INTENCLR_SSL Slave Select Low Interrupt Disable **/
#define SERCOM0_SPI_INTENCLR_SSL		(1 << 3)
/** SERCOM0_SPI_INTENCLR_RXC Receive Complete Interrupt Disable **/
#define SERCOM0_SPI_INTENCLR_RXC		(1 << 2)
/** SERCOM0_SPI_INTENCLR_TXC Transmit Complete Interrupt Disable **/
#define SERCOM0_SPI_INTENCLR_TXC		(1 << 1)
/** SERCOM0_SPI_INTENCLR_DRE Data Register Empty Interrupt Disable **/
#define SERCOM0_SPI_INTENCLR_DRE		(1 << 0)

/**@}*/

/** @defgroup sercom0_usart_intenclr USARTINTENCLR USART Interrupt Enable Clear
@{*/

/** SERCOM0_USART_INTENCLR_ERROR Combined Error Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_ERROR		(1 << 7)
/** SERCOM0_USART_INTENCLR_RXBRK Break Received Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_RXBRK		(1 << 5)
/** SERCOM0_USART_INTENCLR_CTSIC Clear To Send Input Change Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_CTSIC		(1 << 4)
/** SERCOM0_USART_INTENCLR_RXS Receive Start Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_RXS		(1 << 3)
/** SERCOM0_USART_INTENCLR_RXC Receive Complete Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_RXC		(1 << 2)
/** SERCOM0_USART_INTENCLR_TXC Transmit Complete Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_TXC		(1 << 1)
/** SERCOM0_USART_INTENCLR_DRE Data Register Empty Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_DRE		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cm_intenset I2CMINTENSET I2CM Interrupt Enable Set
@{*/

/** SERCOM0_I2CM_INTENSET_ERROR Combined Error Interrupt Enable **/
#define SERCOM0_I2CM_INTENSET_ERROR		(1 << 7)
/** SERCOM0_I2CM_INTENSET_SB Slave On Bus Interrupt Enable **/
#define SERCOM0_I2CM_INTENSET_SB		(1 << 1)
/** SERCOM0_I2CM_INTENSET_MB Master On Bus Interrupt Enable **/
#define SERCOM0_I2CM_INTENSET_MB		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cs_intenset I2CSINTENSET I2CS Interrupt Enable Set
@{*/

/** SERCOM0_I2CS_INTENSET_ERROR Combined Error Interrupt Enable **/
#define SERCOM0_I2CS_INTENSET_ERROR		(1 << 7)
/** SERCOM0_I2CS_INTENSET_DRDY Data Interrupt Enable **/
#define SERCOM0_I2CS_INTENSET_DRDY		(1 << 2)
/** SERCOM0_I2CS_INTENSET_AMATCH Address Match Interrupt Enable **/
#define SERCOM0_I2CS_INTENSET_AMATCH		(1 << 1)
/** SERCOM0_I2CS_INTENSET_PREC Stop Received Interrupt Enable **/
#define SERCOM0_I2CS_INTENSET_PREC		(1 << 0)

/**@}*/

/** @defgroup sercom0_spi_intenset SPIINTENSET SPI Interrupt Enable Set
@{*/

/** SERCOM0_SPI_INTENSET_ERROR Combined Error Interrupt Enable **/
#define SERCOM0_SPI_INTENSET_ERROR		(1 << 7)
/** SERCOM0_SPI_INTENSET_SSL Slave Select Low Interrupt Enable **/
#define SERCOM0_SPI_INTENSET_SSL		(1 << 3)
/** SERCOM0_SPI_INTENSET_RXC Receive Complete Interrupt Enable **/
#define SERCOM0_SPI_INTENSET_RXC		(1 << 2)
/** SERCOM0_SPI_INTENSET_TXC Transmit Complete Interrupt Enable **/
#define SERCOM0_SPI_INTENSET_TXC		(1 << 1)
/** SERCOM0_SPI_INTENSET_DRE Data Register Empty Interrupt Enable **/
#define SERCOM0_SPI_INTENSET_DRE		(1 << 0)

/**@}*/

/** @defgroup sercom0_usart_intenset USARTINTENSET USART Interrupt Enable Set
@{*/

/** SERCOM0_USART_INTENSET_ERROR Combined Error Interrupt Enable **/
#define SERCOM0_USART_INTENSET_ERROR		(1 << 7)
/** SERCOM0_USART_INTENSET_RXBRK Break Received Interrupt Enable **/
#define SERCOM0_USART_INTENSET_RXBRK		(1 << 5)
/** SERCOM0_USART_INTENSET_CTSIC Clear To Send Input Change Interrupt Enable **/
#define SERCOM0_USART_INTENSET_CTSIC		(1 << 4)
/** SERCOM0_USART_INTENSET_RXS Receive Start Interrupt Enable **/
#define SERCOM0_USART_INTENSET_RXS		(1 << 3)
/** SERCOM0_USART_INTENSET_RXC Receive Complete Interrupt Enable **/
#define SERCOM0_USART_INTENSET_RXC		(1 << 2)
/** SERCOM0_USART_INTENSET_TXC Transmit Complete Interrupt Enable **/
#define SERCOM0_USART_INTENSET_TXC		(1 << 1)
/** SERCOM0_USART_INTENSET_DRE Data Register Empty Interrupt Enable **/
#define SERCOM0_USART_INTENSET_DRE		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cm_intflag I2CMINTFLAG I2CM Interrupt Flag Status and Clear
@{*/

/** SERCOM0_I2CM_INTFLAG_ERROR Combined Error Interrupt **/
#define SERCOM0_I2CM_INTFLAG_ERROR		(1 << 7)
/** SERCOM0_I2CM_INTFLAG_SB Slave On Bus Interrupt **/
#define SERCOM0_I2CM_INTFLAG_SB		(1 << 1)
/** SERCOM0_I2CM_INTFLAG_MB Master On Bus Interrupt **/
#define SERCOM0_I2CM_INTFLAG_MB		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cs_intflag I2CSINTFLAG I2CS Interrupt Flag Status and Clear
@{*/

/** SERCOM0_I2CS_INTFLAG_ERROR Combined Error Interrupt **/
#define SERCOM0_I2CS_INTFLAG_ERROR		(1 << 7)
/** SERCOM0_I2CS_INTFLAG_DRDY Data Interrupt **/
#define SERCOM0_I2CS_INTFLAG_DRDY		(1 << 2)
/** SERCOM0_I2CS_INTFLAG_AMATCH Address Match Interrupt **/
#define SERCOM0_I2CS_INTFLAG_AMATCH		(1 << 1)
/** SERCOM0_I2CS_INTFLAG_PREC Stop Received Interrupt **/
#define SERCOM0_I2CS_INTFLAG_PREC		(1 << 0)

/**@}*/

/** @defgroup sercom0_spi_intflag SPIINTFLAG SPI Interrupt Flag Status and Clear
@{*/

